example/basic-workflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de" xml:lang="de">
<head>
<!-- 2017-07-06 Do 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Basic Development Workflow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Patrick Selge &amp; Sebastian May" />
</head>
<body>
<div id="content">
<h1 class="title">Basic Development Workflow</h1>
<p>
Basic Development Workflow
Um ein Docker Image "from scratch" aufzubauen empfiehlt sich zum Beispiel folgende Vorgehensweise:
</p>

<div id="outline-container-org3f02ee2" class="outline-2">
<h2 id="org3f02ee2"><span class="section-number-2">1</span> Überlege dir welche Pakete und welches Basisbetriebssystem du für deine vermutlich Software benötigen wirst</h2>
</div>
<div id="outline-container-org80267a1" class="outline-2">
<h2 id="org80267a1"><span class="section-number-2">2</span> Suche dazu ein passendes Basisimage auf hub.docker.com. Beispiele für Basisimages wären folgende:</h2>
<div class="outline-text-2" id="text-2">
</div><ol class="org-ol"><li><a id="orgf21e28a"></a>debian - wenn du vorher schon weisst dass du .deb Paket installieren musst empfiehlt sich das Image<br /><div class="outline-text-4" id="text-2-0-1">
<p>
Das Image bietet viele Varianten als Tags an:
</p>
<ul class="org-ul">
<li>debian:stretch für das "stretch" Release</li>
<li>debian:stable für das aktuelle stable Release</li>
<li>debian:stable-slim für eine minimale Version des stables releases</li>
<li>etc&#x2026;</li>
</ul>
</div></li>
<li><a id="org00f15a9"></a>centos - wenn du rpm Pakete benötigen wirst<br /><div class="outline-text-4" id="text-2-0-2">
<p>
Auch hier gibt es Tags für die unterschiedlichen Versionen:
</p>
<ul class="org-ul">
<li>centos:centos6 für CentOS 6</li>
<li>centos:centos7 für CentOS 7</li>
</ul>
</div></li>
<li><a id="orgd3a3c43"></a>alpine - wenn du keine großen Abhängigkeiten hast empfiehlt sich dieses besonders minimals Basisimage (es ist nur 5 MB groß!)<br /></li>
<li><a id="orge342d63"></a>jdk, jenkins, etc.<br /><div class="outline-text-4" id="text-2-0-4">
<p>
Für die meiste Software gibt es mittlerweile schon vorgefertigte
Dockerimages die oft selbst eines der vorherigen Images als Basisimage verwenden.
Für ein Image, welches sowieso ein JDK8 benötigt könntest du also zum Beispiel direkt das Image java:8-jdk-alpine verwenden.
</p>
</div></li></ol>
</div>
<div id="outline-container-org14b9431" class="outline-2">
<h2 id="org14b9431"><span class="section-number-2">3</span> erstelle ein Verzeichnis und lege darin ein Dockerfile an</h2>
<div class="outline-text-2" id="text-3">
<p>
Für ein Debian "stretch" Basisimage also das folgende Dockerfile:
</p>
<div class="org-src-container">
<pre class="src src-docker">FROM debian:stretch
</pre>
</div>
</div>
</div>
<div id="outline-container-org30312c5" class="outline-2">
<h2 id="org30312c5"><span class="section-number-2">4</span> baue das Basisimage</h2>
<div class="outline-text-2" id="text-4">
<p>
Anschliessend kannst du aus dem gleichen Verzeichnis heraus das Basisimage bauen:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fb2874;">[</span>~<span style="color: #fb2874;">]</span> docker build -t my-software .
</pre>
</div>
<p>
Damit entsteht ein Image namens "my-software" das nichts weiter als eine Debian Installation enthält.
</p>
</div>
</div>
<div id="outline-container-orga553968" class="outline-2">
<h2 id="orga553968"><span class="section-number-2">5</span> öffne eine root-shell in dem "leeren" Container</h2>
<div class="outline-text-2" id="text-5">
<p>
Um zu deinem Ziel zu kommen, musst du nun Software installieren, Dateien
herunterladen, etc. Damit du nicht raten musst wie die Befehle in Debian
heissen und ob sie verfügbar sind, öffnest du einfach eine Shell in dem
leeren Container, installierst deine Abhängigkeiten und schreibst dabei mit
welche Befehle in welcher Reihenfolge benötigt werden:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fb2874;">[</span>~<span style="color: #fb2874;">]</span> docker run --name my-container -ti my-software /bin/bash
<span style="color: #fb2874;">[</span>root@<span style="color: #9c91e4; font-weight: bold;">2139qwj</span><span style="color: #fb2874;">]</span> apt update
<span style="color: #fb2874;">[</span>root@<span style="color: #9c91e4; font-weight: bold;">2139qwj</span><span style="color: #fb2874;">]</span> apt search stdc++
libstdc++6/stable,now <span style="color: #9c91e4; font-weight: bold;">6.3.0-18</span> amd64
GNU-Implementierung der Standard-C++-Bibliothek <span style="color: #fb2874;">(</span>Version <span style="color: #9c91e4; font-weight: bold;">3</span><span style="color: #fb2874;">)</span>
&#8230;
<span style="color: #fb2874;">[</span>root@<span style="color: #9c91e4; font-weight: bold;">2139qwj</span><span style="color: #fb2874;">]</span> apt install -y libstdc++6
</pre>
</div>
</div>
</div>
<div id="outline-container-org282f343" class="outline-2">
<h2 id="org282f343"><span class="section-number-2">6</span> erweitere dein Dockerfile um die entsprechenden Befehle</h2>
<div class="outline-text-2" id="text-6">
<p>
Wenn du ein paar Befehle zusammen hast um deine Container zum Laufen zu kriegen, füge diese in dein Dockerfile ein<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fb2874;">[</span>~<span style="color: #fb2874;">]</span> pico Dockerfile
</pre>
</div>
<p>
Der Inhalt des Dockerfiles ist in diesem Beispiel dann:
</p>
<div class="org-src-container">
<pre class="src src-docker">FROM debian:stretch
RUN apt update &amp;&amp; apt install -y libstdc++6 &amp;&amp; apt clean
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec0f777" class="outline-2">
<h2 id="orgec0f777"><span class="section-number-2">7</span> Baue das Image neu</h2>
<div class="outline-text-2" id="text-7">
<p>
Danach musst du das Image nochmal bauen, damit deine Änderungen in das Image kommen:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fb2874;">[</span>~<span style="color: #fb2874;">]</span> docker build -t my-software .
</pre>
</div>
</div>
</div>
<div id="outline-container-org6aac2ec" class="outline-2">
<h2 id="org6aac2ec"><span class="section-number-2">8</span> Starte den Container nochmal</h2>
<div class="outline-text-2" id="text-8">
<p>
Um den Container wieder zu starten und in eine Shell zu kommen, musst du ihn vorher entfernen:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fb2874;">[</span>~<span style="color: #fb2874;">]</span> docker rm -f my-container
</pre>
</div>
<p>
Und danach kannst du den Container wieder starten:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fb2874;">[</span>~<span style="color: #fb2874;">]</span> docker run --name my-container -ti my-software /bin/bash
</pre>
</div>
</div>
</div>
<div id="outline-container-org243cc52" class="outline-2">
<h2 id="org243cc52"><span class="section-number-2">9</span> Und so weiter&#x2026;</h2>
<div class="outline-text-2" id="text-9">
<p>
Anschliessend wiederholst du das "Einloggen, Ausführen, Aufschreiben, Anpassen, Neubauen" bis dein Image fertig ist.
Dabei werden natürlich nicht nur "RUN" Docker-Befehle dazu kommen und am Ende sollte zumindest ein "CMD" im Dockerfile stehen :-)
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Fu&szlig;noten: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Es ist best practice seine Images so klein wie möglich zu halten und bei
jedem Schritt im Dockerfile nicht benötigte temporäre Dateien wieder zu
entfernen damit die einzelnen Layer klein bleiben!
</p></div></div>


</div>
</div></div>
</body>
</html>
